{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "stateful": false, "init": "glorot_uniform", "dropout_W": 0.2, "input_length": null, "go_backwards": false, "name": "lstm_1", "W_regularizer": null, "inner_init": "orthogonal", "output_dim": 256, "unroll": false, "input_dim": 68, "U_regularizer": null, "dropout_U": 0.2, "batch_input_shape": [null, 60, 68], "activation": "tanh", "b_regularizer": null, "input_dtype": "float32", "return_sequences": true, "inner_activation": "hard_sigmoid", "forget_bias_init": "one", "consume_less": "cpu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "LSTM", "config": {"stateful": false, "input_dim": 256, "name": "lstm_2", "U_regularizer": null, "unroll": false, "init": "glorot_uniform", "dropout_W": 0.2, "activation": "tanh", "b_regularizer": null, "trainable": true, "forget_bias_init": "one", "return_sequences": false, "go_backwards": false, "inner_activation": "hard_sigmoid", "dropout_U": 0.2, "input_length": null, "W_regularizer": null, "consume_less": "cpu", "inner_init": "orthogonal", "output_dim": 256}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "output_dim": 68, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "1.1.1"}