{"config": [{"config": {"input_dtype": "float32", "inner_activation": "hard_sigmoid", "batch_input_shape": [null, 100, 69], "output_dim": 200, "dropout_W": 0.2, "trainable": true, "forget_bias_init": "one", "input_dim": 69, "dropout_U": 0.2, "stateful": false, "consume_less": "cpu", "unroll": false, "U_regularizer": null, "activation": "tanh", "init": "glorot_uniform", "inner_init": "orthogonal", "name": "lstm_1", "W_regularizer": null, "go_backwards": false, "return_sequences": true, "input_length": null, "b_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.3}, "class_name": "Dropout"}, {"config": {"input_length": null, "activation": "tanh", "output_dim": 200, "U_regularizer": null, "forget_bias_init": "one", "dropout_W": 0.2, "trainable": true, "inner_activation": "hard_sigmoid", "input_dim": 200, "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "name": "lstm_2", "dropout_U": 0.2, "W_regularizer": null, "go_backwards": false, "return_sequences": false, "consume_less": "cpu", "b_regularizer": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.3}, "class_name": "Dropout"}, {"config": {"activation": "linear", "output_dim": 69, "trainable": true, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}