{"keras_version": "1.1.1", "config": [{"config": {"inner_init": "orthogonal", "input_length": null, "input_dtype": "float32", "forget_bias_init": "one", "batch_input_shape": [null, 40, 63], "inner_activation": "hard_sigmoid", "input_dim": 63, "b_regularizer": null, "stateful": false, "init": "glorot_uniform", "output_dim": 256, "U_regularizer": null, "dropout_U": 0.0, "W_regularizer": null, "go_backwards": false, "dropout_W": 0.0, "consume_less": "cpu", "unroll": false, "activation": "tanh", "name": "lstm_1", "return_sequences": true, "trainable": true}, "class_name": "LSTM"}, {"config": {"dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "input_length": null, "activation": "tanh", "forget_bias_init": "one", "return_sequences": false, "W_regularizer": null, "unroll": false, "consume_less": "cpu", "input_dim": 256, "b_regularizer": null, "name": "lstm_2", "trainable": true, "init": "glorot_uniform", "output_dim": 256, "stateful": false, "U_regularizer": null, "dropout_U": 0.0, "inner_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"W_regularizer": null, "bias": true, "activation": "linear", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 63, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}