{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "LSTM", "config": {"input_dtype": "float32", "b_regularizer": null, "batch_input_shape": [null, 40, 63], "dropout_U": 0.0, "dropout_W": 0.0, "inner_init": "orthogonal", "forget_bias_init": "one", "stateful": false, "consume_less": "cpu", "return_sequences": true, "W_regularizer": null, "output_dim": 256, "input_dim": 63, "unroll": false, "U_regularizer": null, "trainable": true, "go_backwards": false, "activation": "tanh", "inner_activation": "hard_sigmoid", "name": "lstm_1", "input_length": null, "init": "glorot_uniform"}}, {"class_name": "LSTM", "config": {"input_dim": 256, "input_length": null, "stateful": false, "inner_activation": "hard_sigmoid", "U_regularizer": null, "unroll": false, "dropout_W": 0.0, "trainable": true, "inner_init": "orthogonal", "forget_bias_init": "one", "go_backwards": false, "b_regularizer": null, "consume_less": "cpu", "activation": "tanh", "dropout_U": 0.0, "name": "lstm_2", "W_regularizer": null, "init": "glorot_uniform", "output_dim": 256, "return_sequences": false}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "b_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "output_dim": 63}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}